In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
sbi=pd.read_csv(r"C:\Users\91849\OneDrive\Desktop\Python\sbi data\EncashmentData.csv")

In [30]:
sbi

      Date of Purchase               Name of the Political Party  Denomination
0            12-Apr-19  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM     1000000.0
1            12-Apr-19  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM     1000000.0
2            12-Apr-19  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM    10000000.0
3            12-Apr-19  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM     1000000.0
4            12-Apr-19  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM     1000000.0
...                ...                                       ...           ...
20841        24-Jan-24                            JANASENA PARTY     1000000.0
20842        24-Jan-24                            JANASENA PARTY     1000000.0
20843        24-Jan-24                            JANASENA PARTY     1000000.0
20844        24-Jan-24                            JANASENA PARTY     1000000.0
20845        24-Jan-24                            JANASENA PARTY     1000000.0

[20421 rows x 3 columns]

In [28]:
sbi.rename(columns={"Date of\nEncashment":"Date of Purchase"},inplace=True)

In [4]:
sbi.isnull().sum()

Date of\nEncashment            425
Name of the Political Party    425
Denomination                   425
dtype: int64

In [5]:
sbi.dropna(inplace=True)

In [6]:
sbi.isnull().sum()

Date of\nEncashment            0
Name of the Political Party    0
Denomination                   0
dtype: int64

In [22]:
sbi['Name of the Political Party'].value_counts()

Name of the Political Party
BHARTIYA JANTA PARTY                              8633
ALL INDIA TRINAMOOL CONGRESS                      3305
PRESIDENT, ALL INDIA CONGRESS COMMITTEE           3146
BHARAT RASHTRA SAMITHI                            1806
BIJU JANATA DAL                                    861
DMK PARTY IN PARLIAMENT                            648
YSR CONGRESS PARTY (YUVAJANA SRAMIKA R             472
SHIVSENA (POLITICAL PARTY)                         354
TELUGU DESAM PARTY                                 279
AAM AADMI PARTY                                    245
RASTRIYA JANTA DAL                                 149
NATIONALIST CONGRESS PARTY PARLIAMENT OF           116
JANATA DAL ( SECULAR )                              75
SIKKIM KRANTIKARI MORCHA                            50
ADYAKSHA SAMAJVADI PARTY                            46
JHARKHAND MUKTI MORCHA                              45
JANASENA PARTY                                      39
ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM            38
SHIROMANI AKALI DAL                                 33
MAHARASHTRAWADI GOMNTAK PARTY                       28
GOA FORWARD PARTY                                   17
BIHAR PRADESH JANTA DAL(UNITED)                     14
SIKKIM DEMOCRATIC FRONT                             10
JAMMU AND KASHMIR NATIONAL CONFERENCE                5
NATIONALIST CONGRESS PARTY MAHARASHTRA PRADESH       5
SHIVSENA                                             1
RASHTRIYA JANTA DAL                                  1
Name: count, dtype: int64

In [24]:
purchase=pd.read_csv(r"C:\Users\91849\OneDrive\Desktop\Python\sbi data\PurchaseData.csv")

In [26]:
purchase

      Date of Purchase                  Purchaser Name  Denomination
0            12-Apr-19             A B C INDIA LIMITED      100000.0
1            12-Apr-19             A B C INDIA LIMITED      100000.0
2            12-Apr-19             A B C INDIA LIMITED     1000000.0
3            12-Apr-19             A B C INDIA LIMITED     1000000.0
4            12-Apr-19             A B C INDIA LIMITED      100000.0
...                ...                             ...           ...
19202        11-Jan-24  WESTWELL GASES PRIVATE LIMITED    10000000.0
19203        11-Jan-24  WESTWELL GASES PRIVATE LIMITED    10000000.0
19204        11-Jan-24  WESTWELL GASES PRIVATE LIMITED    10000000.0
19205        11-Jan-24  WESTWELL GASES PRIVATE LIMITED    10000000.0
19206        11-Jan-24  WESTWELL GASES PRIVATE LIMITED    10000000.0

[19207 rows x 3 columns]

In [32]:
purchase.isnull().sum()

Date of Purchase    336
Purchaser Name      336
Denomination        336
dtype: int64

In [34]:
purchase.dropna(inplace=True)

In [36]:
purchase

      Date of Purchase                  Purchaser Name  Denomination
0            12-Apr-19             A B C INDIA LIMITED      100000.0
1            12-Apr-19             A B C INDIA LIMITED      100000.0
2            12-Apr-19             A B C INDIA LIMITED     1000000.0
3            12-Apr-19             A B C INDIA LIMITED     1000000.0
4            12-Apr-19             A B C INDIA LIMITED      100000.0
...                ...                             ...           ...
19202        11-Jan-24  WESTWELL GASES PRIVATE LIMITED    10000000.0
19203        11-Jan-24  WESTWELL GASES PRIVATE LIMITED    10000000.0
19204        11-Jan-24  WESTWELL GASES PRIVATE LIMITED    10000000.0
19205        11-Jan-24  WESTWELL GASES PRIVATE LIMITED    10000000.0
19206        11-Jan-24  WESTWELL GASES PRIVATE LIMITED    10000000.0

[18871 rows x 3 columns]

In [38]:
purchase.isnull().sum()

Date of Purchase    0
Purchaser Name      0
Denomination        0
dtype: int64

In [40]:
df=pd.merge(sbi,purchase,on=["Date of Purchase","Denomination"],how="inner")

In [42]:
df

,Date of Purchase,Name of the Political Party,Denomination,Purchaser Name
0,12-Apr-19,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000.0,A B C INDIA LIMITED
1,12-Apr-19,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000.0,A B C INDIA LIMITED
2,12-Apr-19,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000.0,A B C INDIA LIMITED
3,12-Apr-19,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000.0,ACROPOLIS MAINTENANCE SERVICES PRIVATE LIMITED
4,12-Apr-19,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000.0,ACROPOLIS MAINTENANCE SERVICES PRIVATE LIMITED
...,...,...,...,...
844886,11-Jan-24,TELUGU DESAM PARTY,10000000.0,WESTWELL GASES PRIVATE LIMITED
844887,11-Jan-24,TELUGU DESAM PARTY,10000000.0,WESTWELL GASES PRIVATE LIMITED
844888,11-Jan-24,TELUGU DESAM PARTY,10000000.0,WESTWELL GASES PRIVATE LIMITED
844889,11-Jan-24,TELUGU DESAM PARTY,10000000.0,WESTWELL GASES PRIVATE LIMITED
844890,11-Jan-24,TELUGU DESAM PARTY,10000000.0,WESTWELL GASES PRIVATE LIMITED

In [46]:
df.isnull().sum()

Date of Purchase               0
Name of the Political Party    0
Denomination                   0
Purchaser Name                 0
dtype: int64

In [48]:
df.drop_duplicates(inplace=True)

In [50]:
df

,Date of Purchase,Name of the Political Party,Denomination,Purchaser Name
0,12-Apr-19,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000.0,A B C INDIA LIMITED
3,12-Apr-19,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000.0,ACROPOLIS MAINTENANCE SERVICES PRIVATE LIMITED
5,12-Apr-19,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000.0,ARIHANT ENTERPRISES
9,12-Apr-19,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000.0,CHOUDHARY GARMENTS
11,12-Apr-19,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000.0,ESSEL MINING AND INDS LTD
...,...,...,...,...
839201,11-Jan-24,TELUGU DESAM PARTY,10000000.0,SYNERGY DEALCOM PVT LTD-SELF A/C
839202,11-Jan-24,TELUGU DESAM PARTY,10000000.0,VEDIKA VANIJYA PVT LTD-SELF A/C
839207,11-Jan-24,TELUGU DESAM PARTY,10000000.0,VIHAAN AUTO VENTURES PRIVATE LIMITED
839209,11-Jan-24,TELUGU DESAM PARTY,10000000.0,WESTERN UP POWER TRANSMISSION COMPANY LI MITED
839239,11-Jan-24,TELUGU DESAM PARTY,10000000.0,WESTWELL GASES PRIVATE LIMITED

In [52]:
df['Date of Purchase'] = pd.to_datetime(df['Date of Purchase'], format='%d-%b-%y')

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2862 entries, 0 to 839239
Data columns (total 4 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Date of Purchase             2862 non-null   datetime64[ns]
 1   Name of the Political Party  2862 non-null   object
 2   Denomination                 2862 non-null   float64
 3   Purchaser Name               2862 non-null   object
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 111.8+ KB

In [58]:
df["Denomination"] = df["Denomination"].astype(int)

In [60]:
df.head(12)

,Date of Purchase,Name of the Political Party,Denomination,Purchaser Name
0,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,A B C INDIA LIMITED
3,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,ACROPOLIS MAINTENANCE SERVICES PRIVATE LIMITED
5,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,ARIHANT ENTERPRISES
9,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,CHOUDHARY GARMENTS
11,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,ESSEL MINING AND INDS LTD
21,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,HIGHSTREET CRUISES AND ENTERTAINMENT PVT LTD
24,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,INNOCENT MERCHANDISE PVT LTD
26,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,KAMLANG SAW & VENEER MILLS PVT LTD
28,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,MERLIN RECREATION PVT LTD
30,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,MYRIAD DEVELOPERS
31,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,SHIVAM TRANSCON PRIVATE LIMITED
36,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,SKYWORLD DEVELOPERS LLP

In [62]:
df.head()

,Date of Purchase,Name of the Political Party,Denomination,Purchaser Name
0,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,A B C INDIA LIMITED
3,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,ACROPOLIS MAINTENANCE SERVICES PRIVATE LIMITED
5,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,ARIHANT ENTERPRISES
9,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,CHOUDHARY GARMENTS
11,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,ESSEL MINING AND INDS LTD

In [64]:
df.to_csv(r'C:\Users\91849\OneDrive\Desktop\Python\Adidas/cleaned_data.csv', index=False)

In [66]:
df['Purchaser Name'].value_counts()

Purchaser Name
VEDANTA LIMITED                                   34
MEGHA ENGINEERING AND INFRASTRUCTURES LI MITED    33
UTKAL ALUMINA INTERNATIONAL LIMITED               25
PRIME SALES CORPORATION                           20
MKJ ENTERPRISES LIMITED                           18
                                                  ..
GREAT EASTERN STORES PVT LTD                       1
AQ SQUARE REALTORS PRIVATE LIMITED                 1
ZUVAN ENERGY PVT LTD                               1
VARSITY EDUCATION MANAGEMENT PVT LIMITED           1
VIDUR GUPTA                                        1
Name: count, Length: 843, dtype: int64